
// Задача 1. Вывод квадрата введенного числа.

// Console.Write("Введите число: ");
// int number = Convert.ToInt32(Console.ReadLine());

// int kvadrat = number * number;


// Console.Write($"Квадрат числа {number} = {kvadrat}.");

// Задача 2. Напишите программу, которая на вход принимает два числа и проверяет, является ли первое число квадратом второго.

Console.Write("Введите число 1: ");
int number_1 = Convert.ToInt32
